data1 = [{"부서" : "영업부" , "직원명단" : ["aaa" ,"bbb" ]},
         {"부서" : "사업부" , "직원명단" : ["ddd" ,"eee" ]},
         {"부서" : "마케팅부","직원명단" : ["ggg" ,"hhh" ]}]

data2 = [{"이름" : "aaa" , "급여" : [10,10,10,10,10,10,10,10,10,10,10,10]},
         {"이름" : "bbb" , "급여" : [20,20,20,20,20,20,20,20,20,20,20,20]},
         {"이름" : "ddd" , "급여" : [30,30,30,30,30,30,30,30,30,30,30,30]},
         {"이름" : "eee" , "급여" : [40,40,40,40,40,40,40,40,40,40,40,40]},
         {"이름" : "ggg" , "급여" : [50,50,50,50,50,50,50,50,50,50,50,50]},
         {"이름" : "hhh" , "급여" : [60,60,60,60,60,60,60,60,60,60,60,60]}]

# 위와 같은 데이터가 있습니다.
# 문제3) 부서명을 치면 직원들의 월급 총액 출력
# 예) 사업부 ==> ddd 와 eee 의 총액
# 무척어렵습니다.(중요한문제 실무에서자주사용하는 키워드에요 )
#이번문제는  11시 10분까지 천천히 풀께요 30분 동안 연구해보세요 for 가 상당히 많이들어가요.
a = "영업부"
total = 0
for i in data1:
   if a == i["부서"]:
      for n in i["직원명단"]:
         print(n)
         for k in data2:
            if n == k["이름"]:
               print(k["급여"])
               for j in k["급여"]:
                  total += j
print(total)
